#+title: Readme
#+PROPERTY: header-args :tangle yes
#+auto_tangle: t
** Run Make and Test
#+begin_src sh :tangle run-make-and-test :shebang #!/usr/bin/env sh
make && cd ../../ && make "test^cpp^step1" && cd impls/cpp/
#+end_src

#+RESULTS:
| g++ | -std=c++17 | -g | -Wall | -Wextra | -Werror | -o | step0_repl       | step0_repl.cpp       |                |                 |               |
| g++ | -std=c++17 | -g | -Wall | -Wextra | -Werror | -o | step1_read_print | step1_read_print.cpp | reader.cpp | printer.cpp | types.cpp |

** Run Make and Launch
#+begin_src sh :tangle run-make-and-launch :shebang #!/usr/bin/env sh
make && ./step1_read_print.cpp
#+end_src

#+RESULTS:
: g++ -std=c++17 -g -Wall -Wextra -Werror -o step1_read_print step1_read_print.cpp reader.cpp src/printer.cpp src/types.cpp

